/*
Доп. задание №1:
Представим банк, в котором алгоритм начисления процента по вкладу зависит от суммы
вклада. На вход будет подаваться число (сумма вклада). При значении меньше 100,
будет начислено 5 %, если значение находится в диапазоне от ста до двухсот — 7 %,
если больше — 10 %. Отработав, программа должна вывести общую сумму с начисленными
процентами.
*/
Console.Write("Введите сумму вклада: ");
double Sum = Convert.ToInt32(Console.ReadLine());
double result = 0;
if (Sum < 100) result = Sum + Sum * 5 / 100;
else if (Sum < 200) result = Sum + Sum * 7 / 100;
else if (Sum >= 200) result = Sum + Sum * 10 / 100;
Console.WriteLine($"Общая сумма в месяц с процентами составляет: {result}");